// Task1
// На старте вы получаете массив. Необходимо написать функцию, которая будет возвращать массив удвоенных значений исходного массива.
//
//     input: [1, 2, 3]
// output: [2, 4, 6]
// input: [4, 1, 1, 1, 4]
// output: [8, 2, 2, 2, 8]
// input: [2, 2, 2, 2, 2, 2]
// output: [4, 4, 4, 4, 4, 4]


// const doubleArr = (arr)=>{
//     return arr.map((item)=>{
//         return item *2
//     })
// }
//
//
// console.log(doubleArr([1,2,3]))
// console.log(doubleArr([4,1,1,1,4]))
// console.log(doubleArr([2,2,2,2,2,2]))

// -------------------------------------------------------------------------
//
//     Task2
// Напишите функцию, которая будет удалять каждый второй элемент в массиве. Цикл for использовать запрещено!
//
//     input: ['Привет', 'Пока', 'Снова привет']
// output: ['Привет', 'Снова привет']
// input: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// output: [1, 3, 5, 7, 9]
// input: ['Пока', {'Цвет': 'Синий'}]
// output: ['Пока']

// const deleteSecondItem = (arr)=>{
//     return arr.filter((item)=>{
//         if( arr.indexOf(item)%2===0){
//             return item
//         }
//     })
// }
//
// console.log(deleteSecondItem([1,2,3,4,5,6,7,8,9,10]))
// console.log(deleteSecondItem(['Hello', 'Bye', 'Hello']))

// -------------------------------------------------------------------------
//
//     Task3
// Возьмите массив с числами, а верните массив, в котором отрицательные числа, становятся положительными, а положительные - отрицательными.
//
//     input: [1, 2, 3, 4, 5]
// output: [-1, -2, -3, -4, -5]
// input: [1, -2, 3, -4, 5]
// output: [-1 ,2, -3, 4, -5]
// input: []
// output: []
// input: [0]
// output: [0]

// const multiplyToNegative =(arr)=>{
//     return arr.map((item)=>{
//         if (item === 0){
//             return item *1
//         }
//         return item *-1
//     })
// }
//
// console.log(multiplyToNegative([1,2,3,4,5]))
// console.log(multiplyToNegative([1, -2, 3, -4, 5]))
// console.log(multiplyToNegative([]))
// console.log(multiplyToNegative([0]))
// -------------------------------------------------------------------------
//
//     Task4
// Напишите функцию, которая принимает в качестве аргументов 2 параметра: массив и число, а возвращает новый массив с тем кол-вом элементов с начала массива, которое было указано в числе.
//
//     input: [0, 1, 2, 3, 5, 8, 13], 3
// output:  [0, 1, 2], 'Вернула первые три значения'
// input: [0, 1, 2, 3, 5, 8, 13], 5
// output:  [0, 1, 2, 3 , 5]



// const sliceFunc = (arr, num) =>{
//
//     return arr.slice(0, num)
// }
// console.log(sliceFunc([0,1,2,3,4,5,6,10], 3))
// console.log(sliceFunc([0,1,2,3,4,5,6,7,8,92], 5))



// -------------------------------------------------------------------------
//
//     Task5
// Вернуть новый массив, состоящий из элементов, кратных их собственному индексу во входном массиве.
//
//     input: [22, -6, 32, 82, 9, 25]
// output: [-6, 32, 25])
// input: [68, -1, 1, -7, 10, 10]
// output: [-1, 10]
// input: [11, -11]
// output [-11]






// -------------------------------------------------------------------------
//
//     Task6
// Напишите функцию, которая принимает на вход массив,
//     и возвращает новый, в котором все элементы типа string заменены на null.
//
//     input: [4, 6, 'Ivan', 5, 'Denis ']
// output: [4, 6, null, 5 , null]

// const stringToNull = (arr)=>{
//     return arr.map((item)=>{
//         if (typeof item=== 'string'){
//             return null
//         }
//         return item
//     })
// }
//
//
// console.log(stringToNull([4, 6, 'Ivan', 5, 'Denis ']))

//
// -------------------------------------------------------------------------
//
//     Task7
// Напишите функцию, которая принимает на вход массив с именами ,
//     и возвращает новый, в котором содержатся имена не длиннее 5 символов.
//
//     input: ['Евдоким','Ivan', 'Игнат', 'Denis ']
// output: ['Ivan', 'Игнат', 'Denis ']

// const shortNames = (arr)=>{
//     return arr.filter((item)=>{
//         return item.length<=5
//     })
// }
//
// console.log(shortNames(['Евдоким','Ivan', 'Игнат', 'Denis']))


// -------------------------------------------------------------------------
//
//     Task8
// Напишите функцию, которая принимает на вход массив чисел,
//     и возвращает новый, в котором все элементы возведены в куб, и те числа,
//     которые кратны и трем и пяти одновременно, заменить их на 0.
//
// input: [7, 8, 15, 30, 2]
// output: [ 343, 512, 0, 0, 8 ]

// const numbersInCube = (arr)=>{
//     return arr.map((item)=>{
//         if (item % 3 ===0 && item %5 ===0){
//             return 0
//         }
//         return item * item * item
//     })
// }
// console.log(numbersInCube([7, 8, 15, 30, 2]))


// -------------------------------------------------------------------------
//
//     Task9
// Напишите функцию, которая принимает на вход массив слов ,
//     и возвращает массив чисел, являющихся длинной слов.
//
//     input: ['Термос', 'Ураган', 'Земля', 'Комбо', 'Корень']
// output: [6, 6, 5, 5, 6]


//
// const lengthOfStrings = (arr) =>{
//     return arr.map((item)=>{
//         return item.length
//     })
// }
//
// console.log(lengthOfStrings(['Термос', 'Ураган', 'Земля', 'Комбо', 'Корень']))
// -------------------------------------------------------------------------
//
//     Task10
// Напишите функцию, которая принимает массив чисел
// и возвращает массив строк по шаблону <div>{number}</div>
//
// input: [1, 2, 3, 4, 5 ]
// output: [ <div>1</div>, <div>2</div>, <div>3</div>, <div>4</div>, <div>5</div> ]


// const numberWrapper = (arr)=>{
//     return arr.map((item)=>{
//         return `<div>${item}</div>`
//     })
// }
//
// console.log(numberWrapper([1, 2, 3, 4, 5 ]))
// -------------------------------------------------------------------------
//
//     Task11
// Напишите функцию, которая принимает массив строк
// и возвращает массив строк с четным количеством букв
//
// Input: ['ab', 'abc', 'abcd']
// Output: ['ab', 'abcd']



// const evenLengthOfStr = (arr) =>{
//     return arr.filter((item)=>{
//         if (item.length%2===0){
//             return item
//         }
//     })
// }
//
// console.log(evenLengthOfStr(['ab', 'abc', 'abcd']))